Backend/app/controllers/areas_controller.rb

SELECT "areas".* FROM "areas"
SELECT "communicable_diseases".* FROM "communicable_diseases" WHERE "communicable_diseases"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
---
    def index
      areas = Area.includes(:communicable_disease).all

SELECT "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_area
      @area = Area.find(params[:id])