Backend/app/controllers/communicable_diseases_controller.rb

SELECT "communicable_diseases".* FROM "communicable_diseases"
---
    def index
      @communicable_diseases = CommunicableDisease.all

INSERT INTO "communicable_diseases" ("name", "image_url", "description", "symptoms", "prevention_measures", "most_prevalent", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
      @communicable_disease = CommunicableDisease.new(comm_disease_params)

      if @communicable_disease.save

UPDATE "communicable_diseases" SET "image_url" = $1, "updated_at" = $2 WHERE "communicable_diseases"."id" = $3
---
    def update
      if @communicable_disease.update(comm_disease_params)

DELETE FROM "communicable_diseases" WHERE "communicable_diseases"."id" = $1  [["id", 4]]
---
    def destroy
      @communicable_disease.destroy

SELECT "communicable_diseases".* FROM "communicable_diseases" WHERE "communicable_diseases"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_communicable_disease
      @communicable_disease = CommunicableDisease.find(params[:id])