Backend/app/controllers/donations_controller.rb

    def create
      donation = @area.donations.new(donation_params)

      if donation.save
---
INSERT INTO "donations" ("amount", "user_id", "area_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", "500.0"], ["user_id", 3], ["area_id", 1], ["created_at", "2023-04-18 08:28:12.816139"], ["updated_at", "2023-04-18 08:28:12.816139"]]

    def set_area
      @area = Area.find(params[:area_id])
---
SELECT "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_donation
      @donation = Donation.find(params[:id])
---
SELECT "donations".* FROM "donations" WHERE "donations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]