Backend/app/controllers/donations_controller.rb

  def index
    @donation = Donation.includes(:area).all
---
SELECT "donations".* FROM "donations" WHERE "donations"."area_id" = $1  [["area_id", 1]]