Backend/app/controllers/reviews_controller.rb

  def set_area
    @area = Area.find(params[:area_id])
---
SELECT "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]