Backend/app/controllers/reviews_controller.rb

    def create
      review = Review.new(review_params)

      if review.save
---
INSERT INTO "reviews" ("comment", "rating", "user_id", "area_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"