Backend/app/controllers/users_controller.rb

  def create
      # create! exceptions will be handled by the rescue_from ActiveRecord::RecordInvalid code
      user = User.create!(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"