Backend/app/controllers/users_controller.rb

    def register
        user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def login
        sql = "email = :email"
        user = User.where(sql, { email: user_params[:email] }).first
---
SELECT "users".* FROM "users" WHERE (email = 'email@gmail.com') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]